[
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Very First Blog",
    "description": "Welcome to our new blog, My Very First Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Hobeen Moon",
        "url": "https://github.com/Hobeen-Moon/Blog.git"
      }
    ],
    "date": "2021-09-20",
    "categories": [],
    "contents": "\r\nAs part of the senior project, I had create a blog. There are many different tools that you could use to create a blog, but I chose distill package in R to create my blog. I Would like to show how I created this blog using distill package in R with github.\r\nFirst, open R studio and install distill package.\r\ninstall.packages(\"distill\")\r\nNext, go to github.com and create new repository.\r\n\r\nAfter you create your repository, copy the URL of your repository and open R Studio. In R Studio, create a new project. When creating a new project, choose version control and choose git options.\r\n\r\n Paste the URL of your repository and select the directory. \r\nAfter creating a new project, run the following command to create a blog using distill package. distill::create_blog(dir = getwd(), title = \"Your Blog Name\") dir command let you choose where you want to create a blog. in this case, I’m creating a blog file to my current working directory and that is why I’m using getwd(). You can change the name of your blog in title.\r\nAfter you run the command and the blog files are created, you need to restart the R Studio.\r\nAfter you restart your R studio, you can find a Build tab on your right top corner of R Studio. Click Build tab and click Build Website. \r\nNow, push everything to github. After you push it to github, go to your github repositary and click Settings  Under settings, go to pages. Change None to master and root to docs and save. \r\nTo create a new blog post, run the following command in your R Studio. distill::create_post(\"creating a blog\") You will see a Rmd file with the name you picked. Distill uses Rmd file and if you want to format it, there are many documentations about Rmd file. I recommend you to Google them and make your blog pretty.\r\nOnce you finish editing your blog, knit Rmd file. GO to Build tab and click Build Website again. Then push everything to github.\r\nNow you can see your blog post if you go to your website’s URL.\r\nYou have to click knit and Build Website whenever you create a new post. You can change the theme of your Rmd file as well. For more information about distill package, please visit Distill Package\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-10-18T21:00:39-06:00",
    "input_file": "welcome.knit.md"
  }
]
